# AceleraDev Codenation - Semana 2

### Túlio Vieira de Souza | Data Scientist

## Manipulando dados

In [1]:
#Importando os pacotes
import pandas as pd
import numpy as np

In [2]:
#acessando o help dos pacotes
pd?

Type:        module
String form: <module 'pandas' from '/home/klimber/codenation/Data-Science-Online/venv/lib/python3.8/site-packages/pandas/__init__.py'>
File:        ~/codenation/Data-Science-Online/venv/lib/python3.8/site-packages/pandas/__init__.py
Docstring:
pandas - a powerful data analysis and manipulation library for Python
=====================================================================

**pandas** is a Python package providing fast, flexible, and expressive data
structures designed to make working with "relational" or "labeled" data both
easy and intuitive. It aims to be the fundamental high-level building block for
doing practical, **real world** data analysis in Python. Additionally, it has
the broader goal of becoming **the most powerful and flexible open source data
analysis / manipulation tool available in any language**. It is already well on
its way toward this goal.

Main Features
-------------
Here are just a few of the things that pandas does well:

  - Easy handling of missing data in floating point as well as non-floating
    point data.
  - Size mutability: columns can be inserted and deleted from DataFrame and
    higher dimensional objects
  - Automatic and explicit data alignment: objects can be explicitly aligned
    to a set of labels, or the user can simply ignore the labels and let
    `Series`, `DataFrame`, etc. automatically align the data for you in
    computations.
  - Powerful, flexible group by functionality to perform split-apply-combine
    operations on data sets, for both aggregating and transforming data.
  - Make it easy to convert ragged, differently-indexed data in other Python
    and NumPy data structures into DataFrame objects.
  - Intelligent label-based slicing, fancy indexing, and subsetting of large
    data sets.
  - Intuitive merging and joining data sets.
  - Flexible reshaping and pivoting of data sets.
  - Hierarchical labeling of axes (possible to have multiple labels per tick).
  - Robust IO tools for loading data from flat files (CSV and delimited),
    Excel files, databases, and saving/loading data from the ultrafast HDF5
    format.
  - Time series-specific functionality: date range generation and frequency
    conversion, moving window statistics, date shifting and lagging.

### Dicionarios

In [3]:
#Criando um dicionário com os dados
dados = {'canal_venda' : ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
        'acessos': [100, 200, 300 ,400, 500],
        'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
        'vendas': [1000.52, 1052.34, 2002, 5000, 300 ]}

In [4]:
#para printar o dicionáario
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300]}

In [5]:
#verificando o tipo do dicionario
type(dados)

dict

In [6]:
#Acessando as chaves do meu dicionario
dados.keys()

dict_keys(['canal_venda', 'acessos', 'site', 'vendas'])

In [7]:
#Acessando uma chave especifica
dados['site']

['site1', 'site1', 'site2', 'site2', 'site3']

In [8]:
#Acessando uma posicao especifica de um dicionario
dados['acessos'][2]

300

In [9]:
#Acessando uma posicao especifica de um dicionario
dados['canal_venda'][2]

'instagram'

In [10]:
#Acessando uma posicao especifica de um dicionario
dados['canal_venda'][:3]

['facebook', 'twitter', 'instagram']

### Listas

In [11]:
type([1,2,3])

list

In [12]:
#Criando uma lista
lista = [200, 200 , 300 ,800, 200]

In [13]:
#printando a lista
lista

[200, 200, 300, 800, 200]

In [14]:
#Vendo valores especificos
lista[1]

200

In [15]:
#fatia da lista
lista[:3]

[200, 200, 300]

In [16]:
# Adicionando a lista ao dicionario 
dados['lista'] = lista

In [17]:
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300],
 'lista': [200, 200, 300, 800, 200]}

### DataFrames

In [18]:
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300],
 'lista': [200, 200, 300, 800, 200]}

In [19]:
#Criar um data frame a partir de um dict
dataframe = pd.DataFrame(dados)

In [20]:
#acessando o dataframe
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

In [21]:
#printando os primeiros casos do dataframe
dataframe.head(2)

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200

In [22]:
#Verificando o formato do dataframe
dataframe.shape

(5, 5)

In [23]:
QQRNOME = dataframe

In [24]:
QQRNOME.shape

(5, 5)

In [25]:
type(QQRNOME)

pandas.core.frame.DataFrame

In [26]:
#Verificando o indice do dataframe
dataframe.index

RangeIndex(start=0, stop=5, step=1)

In [27]:
#Verificando os tipos dos dados do dataframe
dataframe.dtypes

canal_venda     object
acessos          int64
site            object
vendas         float64
lista            int64
dtype: object

In [28]:
#Verificando se existem valores faltantes
dataframe.isna()

   canal_venda  acessos   site  vendas  lista
0        False    False  False   False  False
1        False    False  False   False  False
2        False    False  False   False  False
3        False    False  False   False  False
4        False    False  False   False  False

In [29]:
#printando os nomes das colunas
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista'], dtype='object')

In [30]:
#Acessando uma coluna especifica
dataframe['canal_venda']

0     facebook
1      twitter
2    instagram
3     linkedin
4     facebook
Name: canal_venda, dtype: object

In [31]:
# Criando uma nova coluna
dataframe['nova_coluna'] = [1, 2, 3, 4, 5]

In [32]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [33]:
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista', 'nova_coluna'], dtype='object')

In [34]:
# Removendo colunas
dataframe.drop(columns = ['acessos','site', 'canal_venda'])

    vendas  lista  nova_coluna
0  1000.52    200            1
1  1052.34    200            2
2  2002.00    300            3
3  5000.00    800            4
4   300.00    200            5

In [35]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [36]:
#Mostrando as colunas
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista', 'nova_coluna'], dtype='object')

In [37]:
#Acessando valores especificos
dataframe['acessos'][1]

200

In [38]:
#Acessando fatia de coluna especifica
dataframe['canal_venda'][:2]

0    facebook
1     twitter
Name: canal_venda, dtype: object

In [39]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [40]:
### Fatiando os dados usando o iloc (linhas | colunas)
dataframe.iloc[3:,4:]

   lista  nova_coluna
3    800            4
4    200            5

In [41]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [42]:
#Fatiar os dados usando o loc (indice)
dataframe.loc[:3]

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4

In [43]:
#Selecionando colunas especificas
dataframe[['canal_venda', 'vendas']]

  canal_venda   vendas
0    facebook  1000.52
1     twitter  1052.34
2   instagram  2002.00
3    linkedin  5000.00
4    facebook   300.00

In [44]:
#Passando os valores atraves de lista
filtro = ['canal_venda', 'acessos']

In [45]:
dataframe[filtro]

  canal_venda  acessos
0    facebook      100
1     twitter      200
2   instagram      300
3    linkedin      400
4    facebook      500

In [46]:
# Usando o metodo info()
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   canal_venda  5 non-null      object
 1   acessos      5 non-null      int64
 2   site         5 non-null      object
 3   vendas       5 non-null      float64
 4   lista        5 non-null      int64
 5   nova_coluna  5 non-null      int64
dtypes: float64(1), int64(3), object(2)
memory usage: 368.0+ bytes

In [47]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [48]:
#Pivotando os dados (coluna)
aux = dataframe.pivot(index = 'canal_venda', columns='site', values='acessos')

In [49]:
aux.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, facebook to twitter
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   site1   2 non-null      float64
 1   site2   2 non-null      float64
 2   site3   1 non-null      float64
dtypes: float64(3)
memory usage: 128.0+ bytes

In [101]:
#Completando os valores faltantes usando fillna
#Pivotando os dados (coluna)
aux= dataframe.pivot(index = 'canal_venda', columns='site', values='acessos').fillna(0)
dataframe.pivot(index = 'canal_venda', columns='site', values='acessos').fillna(0)

site         site1  site2  site3
canal_venda
facebook     100.0    0.0  500.0
instagram      0.0  300.0    0.0
linkedin       0.0  400.0    0.0
twitter      200.0    0.0    0.0

In [51]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [52]:
# Mudando as colunas usando o comando melt
dataframe.melt(id_vars='site', value_vars=['canal_venda'])

    site     variable      value
0  site1  canal_venda   facebook
1  site1  canal_venda    twitter
2  site2  canal_venda  instagram
3  site2  canal_venda   linkedin
4  site3  canal_venda   facebook

In [53]:
#Resetando o indice do dataframe
print(aux.columns)
aux = dataframe.reset_index()
print(aux.columns)

Index(['site1', 'site2', 'site3'], dtype='object', name='site')
Index(['index', 'canal_venda', 'acessos', 'site', 'vendas', 'lista',
       'nova_coluna'],
      dtype='object')

In [54]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [105]:
aux = aux.reset_index()

In [106]:
aux

site canal_venda  site1  site2  site3
0       facebook  100.0    0.0  500.0
1      instagram    0.0  300.0    0.0
2       linkedin    0.0  400.0    0.0
3        twitter  200.0    0.0    0.0

In [107]:
#Exemplo do comando melt
aux.melt(id_vars='canal_venda', value_vars=['site1', 'site2', 'site3'])

   canal_venda   site  value
0     facebook  site1  100.0
1    instagram  site1    0.0
2     linkedin  site1    0.0
3      twitter  site1  200.0
4     facebook  site2    0.0
5    instagram  site2  300.0
6     linkedin  site2  400.0
7      twitter  site2    0.0
8     facebook  site3  500.0
9    instagram  site3    0.0
10    linkedin  site3    0.0
11     twitter  site3    0.0

In [58]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [59]:
#Somando as colunas do dataframe
dataframe.sum()

canal_venda    facebooktwitterinstagramlinkedinfacebook
acessos                                            1500
site                          site1site1site2site2site3
vendas                                          9354.86
lista                                              1700
nova_coluna                                          15
dtype: object

In [60]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [61]:
#Somando as linhas do dataframe
dataframe.sum(axis = 1)

0    1301.52
1    1454.34
2    2605.00
3    6204.00
4    1005.00
dtype: float64

In [62]:
#Calculando a mediana das colunas numericas
print('Por linha: ',dataframe.median(axis= 1) )
print('Por coluna: ', dataframe.median())

Por linha:  0    150.0
1    200.0
2    300.0
3    600.0
4    250.0
dtype: float64
Por coluna:  acessos         300.00
vendas         1052.34
lista           200.00
nova_coluna       3.00
dtype: float64

In [63]:
#Calculando a media das colunas númericas
dataframe.mean()

acessos         300.000
vendas         1870.972
lista           340.000
nova_coluna       3.000
dtype: float64

In [64]:
#Calculando o desvio padrão das colunas numericas
dataframe.std()

acessos         158.113883
vendas         1850.931024
lista           260.768096
nova_coluna       1.581139
dtype: float64

In [65]:
#Usando o comando describe que calcula estatisticas descritivas para colunas numericas
dataframe.describe()

          acessos       vendas       lista  nova_coluna
count    5.000000     5.000000    5.000000     5.000000
mean   300.000000  1870.972000  340.000000     3.000000
std    158.113883  1850.931024  260.768096     1.581139
min    100.000000   300.000000  200.000000     1.000000
25%    200.000000  1000.520000  200.000000     2.000000
50%    300.000000  1052.340000  200.000000     3.000000
75%    400.000000  2002.000000  300.000000     4.000000
max    500.000000  5000.000000  800.000000     5.000000

In [66]:
#Calculando a moda
dataframe.mode()

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1   300.00  200.0            1
1         NaN      200  site2  1000.52    NaN            2
2         NaN      300    NaN  1052.34    NaN            3
3         NaN      400    NaN  2002.00    NaN            4
4         NaN      500    NaN  5000.00    NaN            5

In [67]:
# Valor maximo por coluna
dataframe.max()

canal_venda    twitter
acessos            500
site             site3
vendas            5000
lista              800
nova_coluna          5
dtype: object

In [68]:
#Valor minimo por coluna
dataframe.min()

canal_venda    facebook
acessos             100
site              site1
vendas              300
lista               200
nova_coluna           1
dtype: object

In [69]:
#Printando o numero de unicos
dataframe.nunique()

canal_venda    4
acessos        5
site           3
vendas         5
lista          3
nova_coluna    5
dtype: int64

In [70]:
#Contando valores unicos de uma coluna
dataframe['canal_venda'].value_counts()

facebook     2
twitter      1
instagram    1
linkedin     1
Name: canal_venda, dtype: int64

In [71]:
#Valores unicos de uma coluna
dataframe['canal_venda'].unique()

array(['facebook', 'twitter', 'instagram', 'linkedin'], dtype=object)

In [72]:
# Usando o groupby com valores numericos
dataframe.groupby('site')['acessos'].sum()

site
site1    300
site2    700
site3    500
Name: acessos, dtype: int64

In [73]:
# Usando o groupby com valores numericos
dataframe.groupby('canal_venda')['acessos'].median()

canal_venda
facebook     300
instagram    300
linkedin     400
twitter      200
Name: acessos, dtype: int64

In [74]:
# Usando o groupby com categoricos
dataframe.groupby('site')['canal_venda'].unique()

site
site1      [facebook, twitter]
site2    [instagram, linkedin]
site3               [facebook]
Name: canal_venda, dtype: object

In [75]:
# Usando o groupby com categoricos
dataframe.groupby('site')['canal_venda'].first()

site
site1     facebook
site2    instagram
site3     facebook
Name: canal_venda, dtype: object

In [76]:
#Usando o groupby com a função agg
dataframe.groupby('canal_venda').agg({'site': 'unique',
                                     'acessos': 'sum'})

                       site  acessos
canal_venda
facebook     [site1, site3]      600
instagram           [site2]      300
linkedin            [site2]      400
twitter             [site1]      200

In [77]:
#Correlações entre variaveis
dataframe.corr(method = 'spearman')

             acessos    vendas     lista  nova_coluna
acessos      1.00000  0.000000  0.335410      1.00000
vendas       0.00000  1.000000  0.894427      0.00000
lista        0.33541  0.894427  1.000000      0.33541
nova_coluna  1.00000  0.000000  0.335410      1.00000

In [78]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [79]:
#Criando variaveis categoricas por fatia de variavel numerica
dataframe['categoria_vendas'] = pd.cut(dataframe['vendas'],
                                       bins= (0, 1500, 2000, 8000), 
                                       labels = ('0 a 1500', '1500 a 2000', '2000 a 8000'))

In [80]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna categoria_vendas
0    facebook      100  site1  1000.52    200            1         0 a 1500
1     twitter      200  site1  1052.34    200            2         0 a 1500
2   instagram      300  site2  2002.00    300            3      2000 a 8000
3    linkedin      400  site2  5000.00    800            4      2000 a 8000
4    facebook      500  site3   300.00    200            5         0 a 1500

In [81]:
#Criando variavel categorica usando compressao de lista
dataframe['categoria_acessos'] = ['maior_que_300' if x > 300 else 'menor_que_300' for x in dataframe['acessos']]

In [82]:
dataframe

,canal_venda,acessos,site,vendas,lista,nova_coluna,categoria_vendas,categoria_acessos
0,facebook,100,site1,1000.52,200,1,0 a 1500,menor_que_300
1,twitter,200,site1,1052.34,200,2,0 a 1500,menor_que_300
2,instagram,300,site2,2002.00,300,3,2000 a 8000,menor_que_300
3,linkedin,400,site2,5000.00,800,4,2000 a 8000,maior_que_300
4,facebook,500,site3,300.00,200,5,0 a 1500,maior_que_300

In [83]:
#Juntando dois dataframes | Criando o dataframe_2
dataframe_2 = pd.DataFrame({'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
               'suporte': ['Carlos', 'Carlos', 'Maria', 'Maria', 'Ezequiel']})

In [84]:
#Realizando o merge
dataframe.merge(dataframe_2, on = 'site', how = 'left')

,canal_venda,acessos,site,vendas,lista,nova_coluna,categoria_vendas,categoria_acessos,suporte
0,facebook,100,site1,1000.52,200,1,0 a 1500,menor_que_300,Carlos
1,facebook,100,site1,1000.52,200,1,0 a 1500,menor_que_300,Carlos
2,twitter,200,site1,1052.34,200,2,0 a 1500,menor_que_300,Carlos
3,twitter,200,site1,1052.34,200,2,0 a 1500,menor_que_300,Carlos
4,instagram,300,site2,2002.00,300,3,2000 a 8000,menor_que_300,Maria
5,instagram,300,site2,2002.00,300,3,2000 a 8000,menor_que_300,Maria
6,linkedin,400,site2,5000.00,800,4,2000 a 8000,maior_que_300,Maria
7,linkedin,400,site2,5000.00,800,4,2000 a 8000,maior_que_300,Maria
8,facebook,500,site3,300.00,200,5,0 a 1500,maior_que_300,Ezequiel

In [85]:
#Salvando o dataframe como csv
dataframe.to_csv('dataframe.csv', sep = ';', decimal = ',', index = False)

In [86]:
#Lendo dados no formato csv
dataframe_lido = pd.read_csv('dataframe.csv', sep = ';', decimal = ',')

In [87]:
dataframe_lido.head()

,canal_venda,acessos,site,vendas,lista,nova_coluna,categoria_vendas,categoria_acessos
0,facebook,100,site1,1000.52,200,1,0 a 1500,menor_que_300
1,twitter,200,site1,1052.34,200,2,0 a 1500,menor_que_300
2,instagram,300,site2,2002.00,300,3,2000 a 8000,menor_que_300
3,linkedin,400,site2,5000.00,800,4,2000 a 8000,maior_que_300
4,facebook,500,site3,300.00,200,5,0 a 1500,maior_que_300

In [88]:
json = pd.read_json('https://pricing.us-east-1.amazonaws.com/offers/v1.0/aws/index.json')

In [89]:
json['offers'][99]

{'offerCode': 'AmazonMQ',
 'versionIndexUrl': '/offers/v1.0/aws/AmazonMQ/index.json',
 'currentVersionUrl': '/offers/v1.0/aws/AmazonMQ/current/index.json',
 'currentRegionIndexUrl': '/offers/v1.0/aws/AmazonMQ/current/region_index.json'}

In [90]:
json.reset_index(inplace = True)

In [91]:
json['index']

0                    A4B
1             AWSAmplify
2             AWSAppSync
3              AWSBackup
4             AWSBudgets
             ...
143    comprehendmedical
144         datapipeline
145      mobileanalytics
146           transcribe
147            translate
Name: index, Length: 148, dtype: object

## Imputação de dados

In [92]:
df = pd.read_csv('train.csv')

In [93]:
aux = pd.DataFrame({'colunas': df.columns,
                    'tipos': df.dtypes,
                    'percentual_faltante': df.isna().sum() / df.shape[0]})

In [94]:
aux

                 colunas    tipos  percentual_faltante
PassengerId  PassengerId    int64             0.000000
Survived        Survived    int64             0.000000
Pclass            Pclass    int64             0.000000
Name                Name   object             0.000000
Sex                  Sex   object             0.000000
Age                  Age  float64             0.198653
SibSp              SibSp    int64             0.000000
Parch              Parch    int64             0.000000
Ticket            Ticket   object             0.000000
Fare                Fare  float64             0.000000
Cabin              Cabin   object             0.771044
Embarked        Embarked   object             0.002245

In [95]:
#Dados númericos : média ou mediana
df['Age'] = df['Age'].fillna(df['Age'].mode())

In [96]:
#Dados categoricos: Unknown ou moda
df['Cabin'] = df['Cabin'].fillna('Unknown')

In [97]:
df['Cabin'].value_counts()

Unknown        687
G6               4
C23 C25 C27      4
B96 B98          4
C22 C26          3
              ...
B71              1
B19              1
C148             1
D50              1
D49              1
Name: Cabin, Length: 148, dtype: int64

In [98]:
df.shape[0]

891